class 種橫誧誧{
	String 懈窒="に";
	int 陛問=300;
	種橫誧誧(){}
	種橫誧誧(String 懈窒){
		this.懈窒 = 懈窒;
	}
	種橫誧誧(int 陛問){
		this.陛問 = 陛問;
	}
	種橫誧誧(String 懈窒, int 陛問){
		this.懈窒 = 懈窒;
		this.陛問 = 陛問;
	}
}

class 嬴輿該棲{
	int age = 50;
	種橫誧誧 種1,種2,種3,種4;

	

	void 掄朝棻(){
		種1 = new 種橫誧誧();
		種2 = new 種橫誧誧("撲鰻");
		種3 = new 種橫誧誧(500);
		種4 = new 種橫誧誧("堅掘葆", 1000);

		System.out.println("懈窒陛 " + 種1.懈窒 + "檜堅, 陛問檜 " + 種1.陛問 + "檣 種橫誧檜 掘錶螺棻.");
		System.out.println("懈窒陛 " + 種2.懈窒 + "檜堅, 陛問檜 " + 種2.陛問 + "檣 種橫誧檜 掘錶螺棻.");
		System.out.println("懈窒陛 " + 種3.懈窒 + "檜堅, 陛問檜 " + 種3.陛問 + "檣 種橫誧檜 掘錶螺棻.");
		System.out.println("懈窒陛 " + 種4.懈窒 + "檜堅, 陛問檜 " + 種4.陛問 + "檣 種橫誧檜 掘錶螺棻.");
	}
	void っ衙и棻(種橫誧誧 種){
		System.out.println("嬴檜縑啪 陛問檜 " + 種.陛問 + "檣 種橫誧擊 っ衙ц棻.");
	}
}
